"""
Внимательно прочитайте код в этом файле и добавьте свой код везде, где встречается <YOUR CODE>.
Перед каждым заданием вы можете прочитать его описание, помеченное меткой TODO.
для проверки введите из папки с проектом: pytest -vm task_7
"""
from typing import Any, Union, Tuple, Generator


# TODO: реализуйте функцию-генератор для генерации только четных или только нечетных чисел.
#  В диапазоне [start, end] необходимо возвращать все значения по порядку, либо четные, если
#  передан True в is_even, либо нечетные, если передан False в is_even
#  gen_numbers(start: int, end: int, is_even: bool) -> Generator:

"<YOUR CODE>"
