"""
Внимательно прочитайте код в этом файле и добавьте свой код везде, где встречается <YOUR CODE>.
Перед каждым заданием вы можете прочитать его описание, помеченное меткой TODO.
для проверки введите из папки с проектом: pytest -vm test_task_6
"""
from typing import Any, Union, Tuple


data = []
# TODO: реализуйте функцию add_value(new_value: Any) -> None,
#  которая будет добавлять новый элемент в конец списка data
"<YOUR CODE>"


# TODO: реализуйте функцию sum_values(*values: int) -> Tuple[int, int],
#  которая будет возвращать сумму всех значений, переданных в функцию, а так же количество сложенных чисел вторым числом
"<YOUR CODE>"



